In [2]:
%load_ext autoreload
%autoreload 2

In [3]:
from kaggle_competitions.titanic.run import load_train_data, load_test_data
from pathlib import Path

df_train = load_train_data(basedir=Path("."))
df_test = load_test_data(basedir=Path("."))
df_train.head(1)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [4]:
df_test.head(1)

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q

In [10]:
from kaggle_competitions.titanic.run import data_preprocess, run

data_preprocess(df_train)

             Survived  Pclass     Sex        Age  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.000000      0   7.2500        S
2                   1       1  female  38.000000      0  71.2833        C
3                   1       3  female  26.000000      0   7.9250        S
4                   1       1  female  35.000000      0  53.1000        S
5                   0       3    male  35.000000      0   8.0500        S
...               ...     ...     ...        ...    ...      ...      ...
887                 0       2    male  27.000000      0  13.0000        S
888                 1       1  female  19.000000      0  30.0000        S
889                 0       3  female  29.699118      2  23.4500        S
890                 1       1    male  26.000000      0  30.0000        C
891                 0       3    male  32.000000      0   7.7500        Q

[891 rows x 7 columns]

In [7]:
df_train['Ticket'].value_counts()

Ticket
347082      7
CA. 2343    7
1601        7
3101295     6
CA 2144     6
           ..
9234        1
19988       1
2693        1
PC 17612    1
370376      1
Name: count, Length: 681, dtype: int64

In [25]:
from pathlib import Path
from kaggle_competitions.titanic.run import model, log_metrics

basedir = Path()
target_col = "Survived"

df_train = load_train_data(basedir)
df_test = load_test_data(basedir)
df_train, df_test = data_preprocess(df_train), data_preprocess(df_test)
x, y = df_train.drop(columns=[target_col]), df_train[target_col]

pipe = model()
pipe.fit(X=x, y=y)
metrics = log_metrics(x, y, pipe, is_train=True)

In [26]:
metrics.metrics

{'train__random_forest__precision': 0.8992537313432836,
 'train__random_forest__recall': 0.7046783625730995,
 'train__random_forest__log_loss': 5.177988365664417}